In [2]:
import numpy as np
import pandas as pd

In [5]:
# 结合 numpy 创建一个 (3, 10) 区间内的包含 5 个随机整数的一维数组 ndarray 为 data1，并以此 data 再创建索引为 a, b, c, d, e 的 Series 为 s1
data1 = np.random.randint(3, 10, 5)
s1 = pd.Series(data1, index=['a', 'b','c', 'd', 'e'])
s1

a    4
b    6
c    9
d    5
e    9
dtype: int32

In [6]:
# 请分别用位置索引和标签索引的方式提取是 s1 的后三个数
# 位置索引
s1[-3:]

c    9
d    5
e    9
dtype: int32

In [7]:
# 标签索引
s1['c':'e']

c    9
d    5
e    9
dtype: int32

In [9]:
# 请用字典的形式创建一个DataFrame，将下方表格数据存储进去 
df = [{'year':'2017', 'price':10},{'year':'2018','price':20},{'year':'2019','price':30}]
df = pd.DataFrame(df) 
df

   year  price
0  2017     10
1  2018     20
2  2019     30

In [13]:
# 4. 结合 numpy 创建一个 (5, 15) 区间内，形状为 5 行 3 列的随机整数数组为 data2，
data2 = np.random.randint(5, 15,(5, 3))
data2

array([[10, 11, 11],
       [ 8,  5, 10],
       [ 6,  8, 13],
       [10,  5,  7],
       [10,  6, 14]])

In [35]:
# 并以此为基础创建 index 为 ['a', 'c', 'e', 'f', 'h']，columns 为 ['one', 'two', 'three'] 的 DataFrame，并命名为 df_test
df_test = pd.DataFrame(data2, index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'] )
df_test

   one  two  three
a   10   11     11
c    8    5     10
e    6    8     13
f   10    5      7
h   10    6     14

In [36]:
# 5. 运用 loc 索引以及替换的知识，按下列要求对 df_test 进行增、改、替操作。完成上述要求后，将该数据命名为 df_change
# (1) 将 a 行 one 列处替换成空值
df_test.at['a','one'] = None

# (2) 将 c 行 two 列处替换成 -99
df_test.loc['c','two'] = -99

# (3) 将 c 行 three 列处替换成 -99
df_test.at['c','three'] = -99

# (4) 将 a 行 two 列处替换成 -100
df_test.loc['a','two'] = -100

# (5) 新增 four 列，值为 test
df_test['four'] = 'test'
df_test

# (6) 重置索引为 ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
df_change = df_test.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df_change

    one    two  three  four
a   NaN -100.0   11.0  test
b   NaN    NaN    NaN   NaN
c   8.0  -99.0  -99.0  test
d   NaN    NaN    NaN   NaN
e   6.0    8.0   13.0  test
f  10.0    5.0    7.0  test
g   NaN    NaN    NaN   NaN
h  10.0    6.0   14.0  test

In [38]:
# 删除 df_change 中存在缺失值的所有行
df_change.dropna()

    one   two  three  four
c   8.0 -99.0  -99.0  test
e   6.0   8.0   13.0  test
f  10.0   5.0    7.0  test
h  10.0   6.0   14.0  test

In [39]:
# 删除 df_change 中所有值都为 NaN 值的行
df_change.dropna(how='all')

    one    two  three  four
a   NaN -100.0   11.0  test
c   8.0  -99.0  -99.0  test
e   6.0    8.0   13.0  test
f  10.0    5.0    7.0  test
h  10.0    6.0   14.0  test

In [40]:
# df_change 中的所有缺失值（即 NaN）以 0 填充
df_change.fillna(0)

    one    two  three  four
a   0.0 -100.0   11.0  test
b   0.0    0.0    0.0     0
c   8.0  -99.0  -99.0  test
d   0.0    0.0    0.0     0
e   6.0    8.0   13.0  test
f  10.0    5.0    7.0  test
g   0.0    0.0    0.0     0
h  10.0    6.0   14.0  test

In [43]:
# 删除 df_change中的重复行
df_change.drop_duplicates()

    one    two  three  four
a   NaN -100.0   11.0  test
b   NaN    NaN    NaN   NaN
c   8.0  -99.0  -99.0  test
e   6.0    8.0   13.0  test
f  10.0    5.0    7.0  test
h  10.0    6.0   14.0  test